app/Views/CRUD-Clientes.php

SELECT *
FROM `cliente`
---
              </thead>
              <tbody>
    <?php
    $clientes = $cliente_model->findAll();