app/Views/CRUD-Usuarios.php

              </thead>
              <tbody>
    <?php
    $usuarios = $usuarios_model->findAll();
---
SELECT *
FROM `usuario`