app/Views/cuotas-alumno.php

SELECT *
FROM `usuario`
WHERE `id_usuario` = '3'
 LIMIT 1
---
      $nombre = $session->get('usuario_nombre');
    } else {
      $id_usuario = $session->get('pago_alumno');
      $alumno = $usuario_model->where('id_usuario',$session->get('pago_alumno'))->first();

SELECT *
FROM `cuota`
---
          </a>

    <?php }
    $cuotas = $cuota_model->findAll();

SELECT *
FROM `cuota`
WHERE `id_usuario_alumno` = '3'
SELECT *
FROM `cuota_detalle`
WHERE `id_cuota` = '1'
---
          </thead>
          <tbody>
          <?php
              $cuotas_alumno = $cuota_model->where('id_usuario_alumno', $id_usuario)->findAll();
              foreach($cuotas_alumno as $cuota) {
                $cuota_detalle = $cuota_detalle_model->where('id_cuota', $cuota["id_cuota"])->findAll();

SELECT *
FROM `curso`
WHERE `id_curso` = '1'
 LIMIT 1
SELECT *
FROM `idioma`
WHERE `id_idioma` = '1'
 LIMIT 1
---
                  ?>

            <?php foreach ($cuota_detalle as $detalle) {
                    $curso = $curso_model->where('id_curso', $detalle["id_curso"])->first();
                    $idioma = $idioma_model->where('id_idioma', $curso["id_idioma"])->first();?>

SELECT *
FROM `pago`
WHERE `id_cuota` = '2'
 LIMIT 1
---
                    <td rowspan="<?= $cant_detalles?>" class="text-center align-middle"><?= $cuota["cuota_fecha"]; ?></td>
                    <td rowspan="<?= $cant_detalles?>" class="text-center align-middle"><?= $cuota["cuota_monto"]; ?></td>
                    <?php
                    $pago = $pago_model->where('id_cuota', $cuota['id_cuota'])->first();

SELECT *
FROM `cuota_detalle`
WHERE `id_cuota` = '1'
 LIMIT 1
SELECT *
FROM `curso`
WHERE `id_curso` = '1'
 LIMIT 1
SELECT *
FROM `idioma`
WHERE `id_idioma` = '1'
 LIMIT 1
---
                  } ?>

          <?php } else {
                $detalle = $cuota_detalle_model->where('id_cuota', $cuota["id_cuota"])->first();
                $curso = $curso_model->where('id_curso', $detalle["id_curso"])->first();
                $idioma = $idioma_model->where('id_idioma', $curso["id_idioma"])->first();?>

SELECT *
FROM `pago`
WHERE `id_cuota` = '1'
 LIMIT 1
---
                    <td class="text-center align-middle"><?= $cuota["cuota_fecha"]; ?></td>
                    <td class="text-center align-middle"><?= $cuota["cuota_monto"]; ?></td>
                    <?php
                    $pago = $pago_model->where('id_cuota', $cuota['id_cuota'])->first();