app/Views/registrar-pago.php

SELECT *
FROM `usuario`
WHERE `id_usuario` = '3'
 LIMIT 1
SELECT *
FROM `cliente`
WHERE `dni_cliente` = '11111111'
 LIMIT 1
SELECT *
FROM `cuota`
WHERE `id_cuota` = '3'
 LIMIT 1
---
  $cuota_model = new Cuota_model();
  $cliente_model = new Cliente_model();

  $alumno = $usuario_model->where('id_usuario', $session->get('pago_alumno'))->first();
  $cliente = $cliente_model->where('dni_cliente', $session->get('pago_cliente'))->first();
  $cuota = $cuota_model->where('id_cuota', $session->get('pago_cuota'))->first();